# DocumentType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
DocumentCreatingEventArgs..::..DocumentType Property
DocumentCreatingEventArgs Class See Also
---
Type of the document which is about to be created, e.g. Project or Template.
**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2010
# Syntax
C#
---
```text
public DocumentType DocumentType { get; }
```

Visual Basic
---
```text
Public ReadOnly Property DocumentType As DocumentType
	Get
```

Visual C++
---
```text
public:
property DocumentType DocumentType {
	DocumentType get ();
}
```

# See Also
DocumentCreatingEventArgs Class
Autodesk.Revit.DB.Events Namespace